***
<h2 style="text-align:center"> Pandas Assignment</h2>

***

1. How do you load a CSV file into a Pandas DataFrame?

import pandas as pd <br>
DF = pd.read_csv("cricket.csv")

2. How do you check the data type of a column in a Pandas DataFrame?

df.dtypes

3. How do you select rows from a Pandas DataFrame based on a condition?

df.loc[condition]

4. How do you rename columns in a Pandas DataFrame?

df.rename(columns={"Old_Col_name": "new_col_name",......}, inplace=True)

5. How do you drop columns in a Pandas DataFrame?

df.drop('column name', axis=1, inplace=true)

6. How do you find the unique values in a column of a Pandas DataFrame?

df['column name'].unique()

7.  How do you find the number of missing values in each column of a Pandas DataFrame?

df.isnull().sum()

8. How do you fill missing values in a Pandas DataFrame with a specific value?

import pandas as pd

        df = pd.read_csv('data.csv')

        newdf = df.fillna(222222)

9.  How do you concatenate two Pandas DataFrames?

 df_concat = [df1, df2]<br>
        result = pd.concat(df_concat)

10. How do you merge two Pandas DataFrames on a specific column?

df1.merge(df2[['column1', 'column2', 'column3']])

11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

To do grouping use DataFrame.groupby() function. This function returns the DataFrameGroupBy object and use aggregate() function to calculate the sum.<br>

#Use DataFrame.group() Function<br>
result = df.groupby('Courses')['Fee','Discount'].aggregate('sum')<br>
print(result)<br>

#Outputs<br>
           Fee  Discount
Courses 

Hadoop   26000      1200

PySpark    49000      4300

Python   &nbsp; 22000      2500

Spark  &nbsp; &nbsp;&nbsp; 55000      3000

12. How do you pivot a Pandas DataFrame?

he pivot function in pandas is used to reshape the given data frame based on specific columns. Specified columns act as pivots of the data frame. An important thing to note is that the pivot function does not support data aggregation. Instead, multiple columns will return the data frame, becoming multi-indexed.<br>
df.pivot(index='  ', cloumn='    ', values='    ')

13. How do you change the data type of a column in a Pandas DataFrame?

importing pandas as pd<br>
import pandas as pd
 
sample dataframe<br>
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})
 
converting all columns to string type<br>
df = df.astype(str)
print(df.dtypes)
---------
import pandas as pd
 
data = {
  "name": ["Aman", "Hardik", pd.NA],
  "qualified": [True, False, pd.NA]
}
 
df = pd.DataFrame(data)<br>
 
print("Original_dtypes:")<br>
print(df.dtypes,"\n")
 
newdf = df.convert_dtypes()<br>
 
print("New_dtypes:")<br>
print(newdf.dtypes)

14. How do you sort a Pandas DataFrame by a specific column?

df.sort_values('column name')

15. How do you create a copy of a Pandas DataFrame?

import pandas as pd

data = {
  "name": ["Sally", "Mary", "John"],
  "qualified": [True, False, False]
}

df = pd.DataFrame(data)

#Make a copy:

newdf = df.copy()

print(newdf)

16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [6]:
import pandas as pd
 
# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                           
                          'Age': [30, 35, 37, 33, 34, 30],
                           
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                           
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
 
# display dataframe
display(dataFrame)

#using loc
display(dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                    ['Name','JOB']])

#using query
display(dataFrame.query('Salary  <= 100000 & Age < 40 & JOB.str.startswith("C").values'))


#using eval conditions
display(dataFrame[dataFrame.eval("Salary <=100000 & (Age <40) & JOB.str.startswith('A').values")])

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

        Name       JOB
0   RACHEL    DESIGNER

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

        Name  Age  Salary     JOB
5   JOEY       30   95000  ARTIST

17. How do you calculate the mean of a column in a Pandas DataFrame?

#Using DataFrame.mean() to get entire column mean<br>

df2 = df.mean()

print(df2)

#Using multiple columns mean using DataFrame.mean()

df2 = df[["Fee","Discount"]].mean()

print(df2)

18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

df.std()

19. How do you calculate the correlation between two columns in a Pandas DataFrame?

#Correlation between two columns of DataFrame.

corr=df['Fee'].corr(df['Discount'])

print(corr)

20. How do you select specific columns in a DataFrame using their labels?

Method 1: Select One Column by Name

df.loc[:, 'column1']

Method 2: Select Multiple Columns by Name

df.loc[:, ['column1', 'column3', 'column4']]

Method 3: Select Columns in Range by Name

df.loc[:, 'column2':'column4']

21. How do you select specific rows in a DataFrame using their indexes?

ou can select a single row from pandas DataFrame by integer index using df.iloc[n]. Replace n with a position you wanted to select.<br>

Sometimes you may need to get multiple rows from DataFrame by specifies indexes as a list. Certainly, you can do this. For example df.iloc[[2,3,6]] selects rows 3, 4 and 7 as index starts from zero.

22. How do you sort a DataFrame by a specific column

In [7]:
import pandas as pd

data = {'name': ['Somu', 'Kiku', 'Amol', 'Lini'],
	'physics': [68, 74, 77, 78],
	'chemistry': [84, 56, 73, 69],
	'algebra': [78, 88, 82, 87]}

	
#create dataframe
df_marks = pd.DataFrame(data)

#sort dataframe
sorted_df = df_marks.sort_values(by='algebra')
print(sorted_df)

   name  physics  chemistry  algebra
0  Somu       68         84       78
2  Amol       77         73       82
3  Lini       78         69       87
1  Kiku       74         56       88

23. How do you create a new column in a DataFrame based on the values of another column?

 You can add/append a new column to the DataFrame based on the values of another column using df.assign(), df.apply(), and, np.where() functions and return a new Dataframe after adding a new column.

#Below are the quick examples<br>

<li>Example 1: Add Column using arithmetic operation<br>
#based on existing column <br>

df["Final_Fee"] = df["Fee"] - df["Discount"]

<li>Example 2: Add New Column using assign()

df = pd.DataFrame(technologies)

df1 = df.assign(Discount_Percent=lambda x: x.Fee * x.Discount / 100)

<li>Example 3: Add column using np.where()

df['Discount_rating'] = np.where(df['Discount'] > 2000, 'Good', 'Bad')

<li>Example 4: Add column using apply()

df['Final_fee'] = df.apply(lambda x: x['Fee'] - x['Discount'], axis=1)

<li>Example 5: Add column to DataFrame using loc[]

df['Without_discount'] = df.loc[:,['Fee', 'Discount']].sum(axis=1)

24. How do you remove duplicates from a DataFrame?

In [8]:
import pandas as pd

data = {
  "name": ["Sally", "Mary", "John", "Mary"],
  "age": [50, 40, 30, 40],
  "qualified": [True, False, False, False]
}

df = pd.DataFrame(data)

newdf = df.drop_duplicates()

print(newdf)

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False

25. What is the difference between .loc and .iloc in Pandas?

The main difference between pandas loc[] vs iloc[] 

        is loc[] gets DataFrame rows & columns by labels/names and 
        
        iloc[] gets by integer Index/position.